src/BusinessProcesses/РаспределениеЗаявкиФСВТС/РаспределениеЗаявкиФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>РаспределениеЗаявкиФСВТС</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <comment>Фактическая дата завершения бизнес-процесса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Описание задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйРуководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксперт</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределениеСогласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>КодПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбозначениеПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

src/InformationRegisters/РегиональныеРуководителиФСВТС/РегиональныеРуководителиФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегиональныеРуководителиФСВТС</name>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/BusinessProcesses/РаспределениеЗаявкиФСВТС/Forms/ФормаНазначенияРегиональногоРуководителя/Module.bsl
/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаПоказатьВложения(Команда)
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла", 	Объект.Предмет);	
	ПараметрыФормы.Вставить("ТолькоПросмотр", 	Истина);	
	ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры // КомандаПоказатьВложения

/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТабличныйДокумент 							= Документы.ЗаявкаФСВТС.СформироватьТабличныйДокументЗаявки(Объект.Предмет);
	РегиональныйРуководитель 					= Объект.БизнесПроцесс.РегиональныйРуководитель;
	Если Не ЗначениеЗаполнено(РегиональныйРуководитель) Тогда
		РегиональныйРуководитель				= РегистрыСведений.РегиональныеРуководителиФСВТС.ПолучитьРуководителя(Объект.Предмет.Заказчик);
		Модифицированность						= Истина;
	КонецЕсли; // Если Не ЗначениеЗаполнено(РегиональныйРуководитель) Тогда	
	Элементы.КомандаПоказатьВложения.Заголовок 	= Справочники.ЗаявкаФСВТСПрисоединенныеФайлы.ПолучитьКоличество(Объект.Предмет);
КонецПроцедуры // ПриСозданииНаСервере

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	БизнесПроцесс 							= ТекущийОбъект.БизнесПроцесс.ПолучитьОбъект();
	БизнесПроцесс.РегиональныйРуководитель 	= РегиональныйРуководитель;
	БизнесПроцесс.Записать();
КонецПроцедуры // ПриЗаписиНаСервере

&НаКлиенте
Процедура РегиональныйРуководительПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры // РегиональныйРуководительПриИзменении

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Если Модифицированность Тогда
		Попытка
			Записать();
			Модифицированность = Ложь;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать задачу: " + ОписаниеОшибки(),,,,Отказ);
		КонецПопытки;		
	КонецЕсли; // Если Модифицированность Тогда	
КонецПроцедуры // ПередВыполнением
